{
    "workshopId": 2264422885,
    "Title": "Clever Girl",
    "Description": "Clever Girl, a mod for Caves of Qud that lets your companions manage their own\n[list]\n[*]Gear\n[*]Skills\n[*]Mutations\n[*]Attributes\n[/list]\n\nThe primary entry point of the mod is the interact menu with your acquired companions. In addition to the usual \"chat\", \"give items\", etc. commands, you'll now be able to \"manage gear\", \"manage skills\", \"enable gear pickup\", \"manage attributes\", \"manage mutations\", and \"feed\". You can also bind a key to \"Show Companions Menu\" to show a list of all your local companions.\n\n[h1]Managing gear[/h1]\nIf your companion has gear pickup enabled, any time they aren't otherwise occupied (e.g. in combat), they will go pick up any gear they see lying on the ground that's better than what they're wearing and equip it. They can also drop things on the ground if they become overburdened, so be careful with your pack mules. The \"enable follower gear pickup\" option allows any followers of your companion to pick up gear too. You can also use the \"manage gear\" option to directly equip or unequip things to them.\n\n[h1]Managing skills[/h1]\nThe list shows all Skills categories available for your companion to learn, as well as how many Powers they've acquired from each of those categories. Your companion and their followers will spend newly-acquired skill points intelligently* among the categories you select for learning.\n\n[h1]Managing attributes[/h1]\nThe list shows your companion's attributes and their rough proficiency. Any attribute points they acquire will be distributed intelligently* among the attributes you select for them and their followers.\n\n[h1]Managing mutations[/h1]\nThe list shows all Mutations your companion has and their levels, as well as an option to \"Acquire new mutations\". Every mutation point they gain will be intelligently* distributed among the mutations you select for advancement and saving for new mutations. When they have enough to buy a new mutation, you'll get the standard choice of three for them. The \"Acquire new follower mutations\" option is available when your companion has followers; they are eligible to gain any mutation your companion has, and will similarly prioritize point investment.\n\n[h1]Feeding[/h1]\nCompanions and their followers can now be fed at campfires and ovens with the \"Feed companions\" option or directly fed any food item from your inventories, healing them or granting other effects. If they don't like the food, it may take multiple attempts to convince them to eat it.\n\n[h1]Rest until party healed[/h1]\nA bindable \"Rest until party healed\" command simplifies healing up, auto-waiting until every companion you can see is fully healed.\n\n[h1]Becoming nooks[/h1]\nA new \"interface a companion\" option has been added to becoming nooks to manage their cybernetics.\n\n* randomly",
    "Tags": "companions",
    "Visibility": "2",
    "ImagePath": "preview.png"
}
